tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool segmentedSampleAlreadySeen(const WaterRecord* records, std::size_t count, const WaterRecord& record) {
    for (std::size_t i = 0; i < count; ++i) {
        if (sameWaterRecordIdentity(records[i], record)) {
            return true;
        }
    }
    return false;
}

bool appendSegmentedSampleFromTrace(const WaterPulseTrace& trace,
                                    bool savedSource,
                                    SegmentedCalibrationSample* samples,
                                    WaterRecord* seenRecords,
                                    std::size_t& sampleCount,
                                    SegmentedSampleDiagnostics& diagnostics) {
    if (!samples || !seenRecords || sampleCount >= kSegmentedCalibrationMaxSamples || trace.actualMl == 0 ||
        trace.sampleCount < 6 || trace.totalPulses == 0 ||
        segmentedSampleAlreadySeen(seenRecords, sampleCount, trace.record)) {
        return false;
    }
    WaterPulseTraceSample* traceSamples = new (std::nothrow) WaterPulseTraceSample[trace.sampleCount]{};
    if (!traceSamples) {
        return false;
    }
    const bool copied = savedSource ? copySavedTraceSamples(trace, traceSamples, trace.sampleCount)
                                    : copyRamTraceSamples(trace, traceSamples, trace.sampleCount);
    if (!copied) {
        delete[] traceSamples;
        return false;
    }
    const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(trace, traceSamples, trace.sampleCount);
    delete[] traceSamples;
    if (!analysis.stable || analysis.stablePulseCount == 0) {
        return false;
    }
    samples[sampleCount] = SegmentedCalibrationSample{
        trace.actualMl,
        trace.totalPulses,
        analysis.startupPulseCount,
        analysis.stablePulseCount,
        analysis.stableStartSec,
    };
    seenRecords[sampleCount] = trace.record;
    ++sampleCount;
    diagnostics.validSampleCount = static_cast<std::uint16_t>(sampleCount);
    if (trace.startTime >= diagnostics.latestSampleTime) {
        diagnostics.latestSampleTime = trace.startTime;
        diagnostics.latestActualMl = trace.actualMl;
    }
    return true;
}

SegmentedSampleDiagnostics collectSegmentedSampleDiagnostics() {
    SegmentedSampleDiagnostics diagnostics{};
    SegmentedCalibrationSample samples[kSegmentedCalibrationMaxSamples]{};
    WaterRecord seenRecords[kSegmentedCalibrationMaxSamples]{};
    std::size_t sampleCount = 0;

    if (ensureSavedPulseTracesReady()) {
        WaterPulseTrace* savedTraces = new (std::nothrow) WaterPulseTrace[kSavedPulseTraceMaxCountLimit]{};
        if (savedTraces) {
            const std::size_t savedCount =
                g_context.savedPulseTraces->list(savedTraces, kSavedPulseTraceMaxCountLimit);
            for (std::size_t i = 0; i < savedCount && sampleCount < kSegmentedCalibrationMaxSamples; ++i) {
                appendSegmentedSampleFromTrace(
                    savedTraces[i], true, samples, seenRecords, sampleCount, diagnostics);
            }
            delete[] savedTraces;
        }
    }

    if (g_context.pulseTraces) {
        for (std::size_t offset = 0;
             offset < g_context.pulseTraces->count() && sampleCount < kSegmentedCalibrationMaxSamples;
             ++offset) {
            const std::size_t index = g_context.pulseTraces->count() - 1 - offset;
            const WaterPulseTrace* trace = g_context.pulseTraces->traceAt(index);
            if (trace) {
                appendSegmentedSampleFromTrace(*trace, false, samples, seenRecords, sampleCount, diagnostics);
            }
        }
    }

    computeSegmentedCalibration(samples, sampleCount, diagnostics.result);
    diagnostics.validSampleCount = static_cast<std::uint16_t>(sampleCount);
    return diagnostics;
}

bool applySegmentedCalibrationFromAvailableSamples() {
    if (!g_context.config) {
        return false;
    }
    const SegmentedSampleDiagnostics diagnostics = collectSegmentedSampleDiagnostics();
    if (!diagnostics.result.valid) {
        return false;
    }
    SystemConfig next = *g_context.config;
    next.overallPulsePerLiter = diagnostics.result.overallPulsePerLiter;
    next.startupDurationSec = diagnostics.result.startupDurationSec;
    next.startupPulseCount = diagnostics.result.startupPulseCount;
    next.startupVolumeMl = diagnostics.result.startupVolumeMl;
    next.startupPulsePerLiter = diagnostics.result.startupPulsePerLiter;
    next.stablePulsePerLiter = diagnostics.result.stablePulsePerLiter;
    next.segmentedMeteringCalibrated = true;
    return persistConfig(next);
}

bool syncSegmentedCalibrationFromActual(const WaterRecord& record, std::uint32_t actualMl) {
    const bool sampleSynced = autoSaveTraceAsSegmentedSample(record, actualMl);
    const bool fitted = applySegmentedCalibrationFromAvailableSamples();
    return sampleSynced || fitted;
}

void sendSignedLiters(std::int32_t ml) {
    if (ml < 0) {
        Esp32BaseWeb::sendChunk("-");
        sendLiters(static_cast<std::uint32_t>(-ml));
        return;
    }
    Esp32BaseWeb::sendChunk("+");
    sendLiters(static_cast<std::uint32_t>(ml));
}

bool shouldShowTargetDelta(const WaterRecord& record) {
    if (record.mode != WaterMode::Volume || record.targetValue == 0) {
        return false;
    }
    const std::int32_t diff =
        static_cast<std::int32_t>(record.volumeMl) - static_cast<std::int32_t>(record.targetValue);
    const std::uint32_t absDiff = diff < 0 ? static_cast<std::uint32_t>(-diff) : static_cast<std::uint32_t>(diff);
    return absDiff >= 100UL && absDiff * 100UL >= record.targetValue * 3UL;
}

void sendTargetDeltaHint(const WaterRecord& record) {
    if (!shouldShowTargetDelta(record)) {
        return;
    }
    const std::int32_t diff =
        static_cast<std::int32_t>(record.volumeMl) - static_cast<std::int32_t>(record.targetValue);
    Esp32BaseWeb::sendChunk("<small class='hint'>较目标 ");
    sendSignedLiters(diff);
    Esp32BaseWeb::sendChunk("</small>");
}

const char* traceStateText(WaterPulseTraceState state) {
    switch (state) {
        case WaterPulseTraceState::Running:
            return "运行";
        case WaterPulseTraceState::Paused:
            return "暂停";
        case WaterPulseTraceState::Completed:
            return "完成";
        case WaterPulseTraceState::Stopped:
            return "停止";
        case WaterPulseTraceState::PauseTimeout:
            return "暂停超时";
        case WaterPulseTraceState::SafetyStopped:
            return "安全停止";
        case WaterPulseTraceState::Error:
        default:
            return "异常";
    }
}

void sendPlainTextResponse(int status, const char* body) {
    Esp32BaseWeb::sendResponseHeader("Cache-Control", "no-store");
    Esp32BaseWeb::sendResponseHeader("X-Content-Type-Options", "nosniff");
    if (!Esp32BaseWeb::beginResponse(status, "text/plain; charset=utf-8", nullptr)) {
        return;
    }
    Esp32BaseWeb::sendChunk(body ? body : "");
    Esp32BaseWeb::endResponse();
}

std::size_t rawTracePreviewSampleCount(const WaterPulseTrace& trace) {
    const std::size_t previewLimit = kRawTracePreviewLastSecond + 1U;
    return std::min(trace.sampleCount, previewLimit);
}

void sendPulseTraceRawText(const WaterPulseTrace& trace,
                           const WaterPulseTraceSample* samples,
                           bool rawTraceShowAll) {
    Esp32BaseWeb::sendResponseHeader("Cache-Control", "no-store");
    Esp32BaseWeb::sendResponseHeader("X-Content-Type-Options", "nosniff");
    if (!Esp32BaseWeb::beginResponse(200, "text/plain; charset=utf-8", nullptr)) {
        return;
    }
    Esp32BaseWeb::sendChunk("时间\t脉冲数\t累计脉冲数\t状态\n");
    std::uint32_t cumulative = 0;
    const std::size_t sampleCount = rawTraceShowAll ? trace.sampleCount : rawTracePreviewSampleCount(trace);
    for (std::size_t i = 0; i < sampleCount; ++i) {
        cumulative += samples[i].pulseDelta;
        sendFmt("%lu秒\t%u\t%lu\t%s\n",
                static_cast<unsigned long>(i),
                static_cast<unsigned>(samples[i].pulseDelta),
                static_cast<unsigned long>(cumulative),
                traceStateText(samples[i].state));
    }
    if (!rawTraceShowAll && trace.sampleCount > sampleCount) {
        sendFmt("仅显示 0秒 到 %lu秒，共 %lu 行；完整明细请使用 all=1。\n",
                static_cast<unsigned long>(kRawTracePreviewLastSecond),
                static_cast<unsigned long>(sampleCount));
    }
    Esp32BaseWeb::endResponse();
}

std::uint32_t bucketRunningPulseDelta(const WaterPulseTraceSample* samples,
                                      std::size_t sampleCount,
                                      const WaterPulseTraceBucket& bucket) {
    if (!samples || sampleCount == 0) {
        return bucket.state == WaterPulseTraceState::Running ? bucket.pulseDelta : 0;
    }
    const std::size_t begin = std::min<std::size_t>(sampleCount, bucket.startSec);
    const std::size_t end = std::min<std::size_t>(sampleCount, begin + bucket.durationSec);
    std::uint32_t total = 0;
    for (std::size_t i = begin; i < end; ++i) {
        if (samples[i].state == WaterPulseTraceState::Running) {
            total += samples[i].pulseDelta;
        }
    }
    return total;
}

bool bucketOnlyHasRunningSamples(const WaterPulseTraceSample* samples,
                                 std::size_t sampleCount,
                                 const WaterPulseTraceBucket& bucket) {
    if (!samples || sampleCount == 0) {
        return bucket.state == WaterPulseTraceState::Running;
    }
    const std::size_t begin = std::min<std::size_t>(sampleCount, bucket.startSec);
    const std::size_t end = std::min<std::size_t>(sampleCount, begin + bucket.durationSec);
    if (begin >= end) {
        return false;
    }
    for (std::size_t i = begin; i < end; ++i) {
        if (samples[i].state != WaterPulseTraceState::Running) {
            return false;
        }
    }
    return true;
}

void formatKb(std::size_t bytes, char* out, std::size_t len) {
    const std::uint32_t tenths = static_cast<std::uint32_t>((bytes * 10U + 512U) / 1024U);
    std::snprintf(out, len, "%lu.%luKB", static_cast<unsigned long>(tenths / 10U),
                  static_cast<unsigned long>(tenths % 10U));
}

void sendSegmentedMeteringPanel() {
    const SystemConfig& config = *g_context.config;
    const SegmentedSampleDiagnostics diagnostics = collectSegmentedSampleDiagnostics();
    const SegmentedCalibrationResult& result = diagnostics.result;
    const bool candidateReady = result.valid || config.segmentedMeteringCalibrated;
    const std::uint32_t stablePulsePerLiter =
        result.valid ? result.stablePulsePerLiter : config.stablePulsePerLiter;
    const std::uint32_t startupVolumeMl = result.valid ? result.startupVolumeMl : config.startupVolumeMl;
    const std::uint32_t startupPulseCount = result.valid ? result.startupPulseCount : config.startupPulseCount;
    const std::uint32_t startupDurationSec = result.valid ? result.startupDurationSec : config.startupDurationSec;
    const std::uint32_t overallPulsePerLiter =
        result.valid ? result.overallPulsePerLiter : config.overallPulsePerLiter;
    char control[24]{};
    char stable[24]{};
    char startup[64]{};
    char sampleRange[64]{};
    char compensation[24]{};
    char error[24]{};
    char overall[24]{};
    std::snprintf(control,
                  sizeof(control),
                  "%luP/L",
                  static_cast<unsigned long>(pulsePerLiterFromPulsePerMl(config.pulsePerMl)));
    std::snprintf(stable,
                  sizeof(stable),
                  stablePulsePerLiter == 0 ? "待拟合" : "%luP/L",
                  static_cast<unsigned long>(stablePulsePerLiter));
    if (startupDurationSec > 0 || startupPulseCount > 0 || startupVolumeMl > 0) {
        char volume[24]{};
        formatLiters(startupVolumeMl, volume, sizeof(volume));
        std::snprintf(startup,
                      sizeof(startup),
                      "%s / %lus / %luP",
                      volume,
                      static_cast<unsigned long>(startupDurationSec),
                      static_cast<unsigned long>(startupPulseCount));
    } else {
        std::snprintf(startup, sizeof(startup), "待拟合");
    }
    if (result.valid) {
        char minVolume[24]{};
        char maxVolume[24]{};
        formatLiters(result.minActualMl, minVolume, sizeof(minVolume));
        formatLiters(result.maxActualMl, maxVolume, sizeof(maxVolume));
        std::snprintf(sampleRange,
                      sizeof(sampleRange),
                      "%u条 / %s-%s",
                      static_cast<unsigned>(result.sampleCount),
                      minVolume,
                      maxVolume);
    } else if (diagnostics.validSampleCount > 0) {
        std::snprintf(sampleRange,
                      sizeof(sampleRange),
                      "%u条 / 需差异样本",
                      static_cast<unsigned>(diagnostics.validSampleCount));
    } else {
        std::snprintf(sampleRange, sizeof(sampleRange), "0条");
    }
    if (stablePulsePerLiter > 0 && startupVolumeMl > 0) {
        const std::uint32_t startupPulseMl =
            static_cast<std::uint32_t>((static_cast<std::uint64_t>(startupPulseCount) * 1000ULL +
                                        stablePulsePerLiter / 2ULL) /
                                       stablePulsePerLiter);
        const std::uint32_t compensationMl =
            startupVolumeMl > startupPulseMl ? startupVolumeMl - startupPulseMl : 0;
        formatLiters(compensationMl, compensation, sizeof(compensation));
    } else {
        std::snprintf(compensation, sizeof(compensation), "-");
    }
    if (result.valid) {
        std::snprintf(error, sizeof(error), "±%luml", static_cast<unsigned long>(result.maxErrorMl));
    } else {
        std::snprintf(error, sizeof(error), "-");
    }
    std::snprintf(overall,
                  sizeof(overall),
                  overallPulsePerLiter == 0 ? "-" : "%luP/L",
                  static_cast<unsigned long>(overallPulsePerLiter));
    Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel metering-diagnostic'><div class='diagnostic-head'><h3>计量诊断</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div><div class='diagnostic-metric-grid three'>",
            candidateReady ? "status-ok" : "status-muted",
            candidateReady ? "候选已生成" : "样本不足");
    sendFmt("<div class='diagnostic-metric'><span>控制P/L</span><strong>%s</strong></div>", control);
    sendFmt("<div class='diagnostic-metric'><span>稳态P/L</span><strong>%s</strong></div>", stable);
    sendFmt("<div class='diagnostic-metric'><span>启动等效</span><strong>%s</strong></div>", startup);
    sendFmt("<div class='diagnostic-metric'><span>样本范围</span><strong>%s</strong></div>", sampleRange);
    sendFmt("</div><div class='diagnostic-foot'><span>建议补偿 <b>%s</b></span><span>拟合误差 <b>%s</b></span><span>全程平均 <b>%s</b></span></div></section>",
            compensation,
            error,
            overall);
}

void sendPulseTraceCachePanel() {
    WaterPulseTraceStats stats{};
    if (!g_context.pulseTraces) {
        Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel trace-cache-diagnostic'><div class='diagnostic-head'><h3>临时缓存</h3>"
                                "<span class='status-pill status-error'>RAM 不可用</span></div>"
                                "<div class='diagnostic-metric-grid'><div class='diagnostic-metric'><span>明细</span><strong>-</strong></div>"
                                "<div class='diagnostic-metric'><span>数据点</span><strong>-</strong></div></div>"
                                "<div class='diagnostic-foot'><span>占用 <b>-</b></span></div></section>");
    } else {
        stats = g_context.pulseTraces->stats();
        char used[24]{};
        char budget[24]{};
        formatKb(stats.usedBytes, used, sizeof(used));
        formatKb(stats.budgetBytes, budget, sizeof(budget));
        const std::size_t budgetSamples = stats.budgetBytes / sizeof(WaterPulseTraceSample);
        const std::size_t supportedSamples = std::min(stats.sampleCapacity, budgetSamples);
        char traces[24]{};
        char samples[32]{};
        std::snprintf(traces,
                      sizeof(traces),
                      "%lu / %lu 条",
                      static_cast<unsigned long>(stats.traceCount),
                      static_cast<unsigned long>(stats.traceCapacity));
        std::snprintf(samples,
                      sizeof(samples),
                      "%lu / 约%lu 点",
                      static_cast<unsigned long>(stats.sampleCount),
                      static_cast<unsigned long>(supportedSamples));
        Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel trace-cache-diagnostic'><div class='diagnostic-head'><h3>临时缓存</h3>"
                                "<span class='status-pill status-muted ram-badge'>RAM</span></div><div class='diagnostic-metric-grid'>");
        sendFmt("<div class='diagnostic-metric'><span>明细</span><strong>%s</strong></div>", traces);
        sendFmt("<div class='diagnostic-metric'><span>数据点</span><strong>%s</strong></div>", samples);
        sendFmt("</div><div class='diagnostic-foot'><span>占用 <b>%s / %s</b></span><span><b>%u%%</b></span></div></section>",
                used,
                budget,
                static_cast<unsigned>(stats.usagePercent));
    }

