tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    Esp32BaseWeb::sendHeader("容量校准");
    Esp32BaseWeb::sendChunk("<h2>容量校准</h2>");
    if (!canCalibrate) {
        Esp32BaseWeb::sendChunk("<p class='err'>最新记录不可校准。</p><p><a class='btn-link' href='/faucet/records'>返回记录</a></p>");
        sendPageEnd();
        return;
    }

    char startTime[40]{};
    formatWaterRecordTime(record, startTime, sizeof(startTime));
    WaterRecordCalibration calibration{};
    const bool calibrated = findRecordCalibration(record, calibration);
    const std::uint32_t defaultActualMl = calibrated ? calibration.actualMl : record.volumeMl;
    const std::uint32_t pulsePerLiter = pulsePerLiterFromPulsePerMl(record.pulsePerMlAtRun);
    const std::uint32_t measuredPpl = calibrated ? measuredPulsePerLiter(record, calibration) : 0;
    char targetText[32]{};
    char estimatedText[24]{};
    formatRecordTargetValue(record, targetText, sizeof(targetText));
    formatLiters(record.volumeMl, estimatedText, sizeof(estimatedText));

    Esp32BaseWeb::sendChunk("<section class='panel'><h3>出水信息</h3><table class='kv'>");
    sendFmt("<tr><th>开始时间</th><td>%s</td></tr>", startTime);
    sendFmt("<tr><th>目标</th><td>%s</td></tr>", targetText);
    Esp32BaseWeb::sendChunk("<tr><th>出水量</th><td>");
    Esp32BaseWeb::sendChunk(estimatedText);
    Esp32BaseWeb::sendChunk("</td></tr>");
    sendFmt("<tr><th>原始脉冲</th><td>%luP</td></tr>",
            static_cast<unsigned long>(record.pulseCount));
    sendFmt("<tr><th>当时脉冲/升</th><td>%luP/L</td></tr>",
            static_cast<unsigned long>(pulsePerLiter));
    sendFmt("<tr><th>用时</th><td>%u s</td></tr>", static_cast<unsigned>(record.durationSec));
    sendFmt("<tr><th>结束原因</th><td>%s</td></tr>", resultText(record.result));
    Esp32BaseWeb::sendChunk("</table></section>");
    if (calibrated) {
        char calibratedAt[40]{};
        formatWaterRecordTime(WaterRecord{calibration.calibratedAt,
                                          0,
                                          0,
                                          0,
                                          0,
                                          0,
                                          WaterMode::Volume,
                                          WaterResult::Completed,
                                          0,
                                          0,
                                          0.0f,
                                          {0, 0, 0, 0}},
                              calibratedAt,
                              sizeof(calibratedAt));
        const std::int32_t estimateDiff =
            static_cast<std::int32_t>(record.volumeMl) - static_cast<std::int32_t>(calibration.actualMl);
        Esp32BaseWeb::sendChunk("<section class='panel'><h3>上次校准记录</h3><table class='kv'>");
        Esp32BaseWeb::sendChunk("<tr><th>实测出水量</th><td>");
        sendLitersMl(calibration.actualMl);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>实测脉冲/升</th><td>");
        sendFmt("%luP/L", static_cast<unsigned long>(measuredPpl));
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>估算差</th><td>");
        sendSignedLiters(estimateDiff);
        sendFmt("</td></tr><tr><th>校准次数</th><td>第 %u 次</td></tr>",
                static_cast<unsigned>(calibration.calibrationCount));
        Esp32BaseWeb::sendChunk("<tr><th>控制参数</th><td>未修改</td></tr>");
        sendFmt("<tr><th>校准时间</th><td>%s</td></tr></table></section>",
                calibratedAt[0] ? calibratedAt : "未知");
    }
    Esp32BaseWeb::sendChunk("<section class='panel'><h3>实际出水量</h3>"
                            "<form method='post' action='/api/faucet/records' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='calibrate'>"
                            "<label class='field'><span>实际出水量 (ml)</span>");
    sendFmt("<input name='actualMl' type='number' min='%lu' max='%lu' step='1' value='%lu'></label>",
            static_cast<unsigned long>(kMinVolumePresetMl),
            static_cast<unsigned long>(kMaxVolumePresetMl),
            static_cast<unsigned long>(defaultActualMl));
    Esp32BaseWeb::sendChunk("<p class='hint'>保存这条记录的实际容量，并自动更新分段样本库和候选参数；不会修改原始脉冲和当前关阀控制 P/L。</p>"
                            "<div class='form-actions'><input type='submit' value='");
    Esp32BaseWeb::sendChunk("保存校准");
    Esp32BaseWeb::sendChunk("'><a class='btn-link' href='/faucet/records'>取消</a></div></form></section>");
    sendPageEnd();
}

void handleRecordDetailPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    char text[24]{};
    bool rawRequest = false;
    if (getParam("raw", text, sizeof(text))) {
        std::uint32_t rawValue = 0;
        rawRequest = parseU32(text, rawValue) && rawValue != 0;
    }
    bool rawTraceShowAll = false;
    if (getParam("all", text, sizeof(text))) {
        std::uint32_t allValue = 0;
        rawTraceShowAll = parseU32(text, allValue) && allValue != 0;
    }
    if (!contextReady()) {
        if (rawRequest) {
            sendPlainTextResponse(503, "上下文未就绪。\n");
        } else {
            Esp32BaseWeb::sendHeader("脉冲明细");
            Esp32BaseWeb::sendChunk("<h2>脉冲明细</h2><p class='err'>上下文未就绪。</p>");
            sendPageEnd();
        }
        return;
    }
    if (!g_context.pulseTraces && !g_context.savedPulseTraces) {
        if (rawRequest) {
            sendPlainTextResponse(503, "脉冲明细缓存不可用。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<h2>脉冲明细</h2><p class='err'>脉冲明细缓存不可用。</p><p><a class='btn-link' href='/faucet/records'>返回记录</a></p>");
        sendPageEnd();
        return;
    }
    std::uint32_t traceId = 0;
    if (!getParam("trace", text, sizeof(text)) || !parseU32(text, traceId)) {
        if (rawRequest) {
            sendPlainTextResponse(400, "明细编号无效。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<h2>脉冲明细</h2><p class='err'>明细编号无效。</p><p><a class='btn-link' href='/faucet/records'>返回记录</a></p>");
        sendPageEnd();
        return;
    }
    std::uint32_t bucketSeconds = 1;
    if (getParam("bucket", text, sizeof(text))) {
        parseU32(text, bucketSeconds);
    }
    if (bucketSeconds != 2 && bucketSeconds != 3 && bucketSeconds != 4 && bucketSeconds != 5) {
        bucketSeconds = 1;
    }
    bool savedSource = false;
    if (getParam("saved", text, sizeof(text))) {
        std::uint32_t savedValue = 0;
        savedSource = parseU32(text, savedValue) && savedValue != 0;
    }
    WaterPulseTrace savedTrace{};
    const WaterPulseTrace* trace = nullptr;
    if (savedSource) {
        if (ensureSavedPulseTracesReady() && g_context.savedPulseTraces->findById(traceId, savedTrace)) {
            trace = &savedTrace;
        }
    } else if (g_context.pulseTraces) {
        trace = g_context.pulseTraces->findById(traceId);
    }
    if (!trace) {
        if (rawRequest) {
            sendPlainTextResponse(404, "该脉冲明细不存在或已被 RAM 缓存淘汰。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<h2>脉冲明细</h2><p class='err'>该脉冲明细不存在或已被 RAM 缓存淘汰。</p><p><a class='btn-link' href='/faucet/records'>返回记录</a></p>");
        sendPageEnd();
        return;
    }

